In [1]:
import pandas as pd
data = {
'mass': [1.482e23, 1.076e23, 8.932e22, 4.800e22, 7.342e22],
'radius': [2.634e6, None , 1.822e6, None , 1.737e6],
'planet': ['Jupiter', 'Jupiter', 'Jupiter', 'Jupiter', 'Earth']
}
index = ['Ganymede', 'Callisto', 'Io', 'Europa', 'Moon']

In [2]:
df = pd.DataFrame(data=data, index=index)
df

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [3]:
df.dropna()

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [4]:
df.isnull()

           mass  radius  planet
Ganymede  False   False   False
Callisto  False    True   False
Io        False   False   False
Europa    False    True   False
Moon      False   False   False

In [5]:
df.isna()

           mass  radius  planet
Ganymede  False   False   False
Callisto  False    True   False
Io        False   False   False
Europa    False    True   False
Moon      False   False   False

In [6]:
df.fillna(0.00)

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        0.0  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        0.0  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [7]:
# rename row the default
df.rename({'Io':'Africa'})

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Africa    8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [8]:
df.rename({'parent': 'Ancestose'}, axis='columns')

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [9]:
df['mass'][2]

8.932e+22

In [10]:
df['mass']['Io']

8.932e+22

In [11]:
print(df.loc['Moon'], end='')

mass      73419999999999996854272.0
radius                    1737000.0
planet                        Earth
Name: Moon, dtype: object

In [12]:
df.loc['Europa', ['mass', 'radius']]

mass      48000000000000000000000.0
radius                          NaN
Name: Europa, dtype: object

In [13]:
df.loc[['Io'], ['mass', 'radius']]

            mass     radius
Io  8.932000e+22  1822000.0

In [14]:
df

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Io        8.932000e+22  1822000.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [15]:
df.loc['Callisto':, ['mass', 'radius']]

                  mass     radius
Callisto  1.076000e+23        NaN
Io        8.932000e+22  1822000.0
Europa    4.800000e+22        NaN
Moon      7.342000e+22  1737000.0

In [16]:
df.loc['Io':, 'radius':]

           radius   planet
Io      1822000.0  Jupiter
Europa        NaN  Jupiter
Moon    1737000.0    Earth

In [17]:
df.loc['Io']['radius']

1822000.0

In [18]:
df.loc['Io','radius'] = 345567

In [19]:
df.loc[df.planet == 'Jupiter', ['mass', 'planet']]

                  mass   planet
Ganymede  1.482000e+23  Jupiter
Callisto  1.076000e+23  Jupiter
Io        8.932000e+22  Jupiter
Europa    4.800000e+22  Jupiter

In [20]:
df

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23        NaN  Jupiter
Io        8.932000e+22   345567.0  Jupiter
Europa    4.800000e+22        NaN  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [22]:
df.iloc[0:3, [1, 2]]

             radius   planet
Ganymede  2634000.0  Jupiter
Callisto        NaN  Jupiter
Io         345567.0  Jupiter

In [23]:
df.iloc[:, :2]

                  mass     radius
Ganymede  1.482000e+23  2634000.0
Callisto  1.076000e+23        NaN
Io        8.932000e+22   345567.0
Europa    4.800000e+22        NaN
Moon      7.342000e+22  1737000.0

In [26]:
df.iloc[1, 1] = 3000
df.iloc[3, 1] = 3000
df

                  mass     radius   planet
Ganymede  1.482000e+23  2634000.0  Jupiter
Callisto  1.076000e+23     3000.0  Jupiter
Io        8.932000e+22   345567.0  Jupiter
Europa    4.800000e+22     3000.0  Jupiter
Moon      7.342000e+22  1737000.0    Earth

In [28]:
df.iloc[-1, 1:]

radius    1737000.0
planet        Earth
Name: Moon, dtype: object

In [32]:
import numpy as np
df_nums = pd.DataFrame((np.arange(12) + 10).reshape(4, 3), index=[1, 2, 3, 4], columns=list('abc'))
df_nums

    a   b   c
1  10  11  12
2  13  14  15
3  16  17  18
4  19  20  21

In [34]:
df_nums.loc[1]

a    10
b    11
c    12
Name: 1, dtype: int32

In [35]:
df_nums.iloc[1]

a    13
b    14
c    15
Name: 2, dtype: int32

In [39]:
df_nums.iloc[0:2, 1:]

    b   c
1  11  12
2  14  15

In [35]:
import pandas as pd
import numpy as np
boeing_wingspan = pd.Series({'B747-8': 68.4, 'B777-9': 64.8, 'B787-10': 60.12}, name='wingspan')
boeing_length = pd.Series({'B747-8': 76.3, 'B777-9': 76.7, 'B787-10': 68.28}, name='length')
boeing_range = pd.Series({'B777-9': 13940, 'B787-10': 11910},name='range', dtype=float)

In [36]:
df_boeings = pd.DataFrame({'wingspan':boeing_wingspan, 'length': boeing_length, 'range': boeing_range })
df_boeings['BB6'] = [np.nan, 4550, 8866]
df_boeings

         wingspan  length    range     BB6
B747-8      68.40   76.30      NaN     NaN
B777-9      64.80   76.70  13940.0  4550.0
B787-10     60.12   68.28  11910.0  8866.0

In [37]:

df_airbus = pd.DataFrame({'range': {'A350-1000': 16100, 'A380-800': 14800}, 'wingspan': {'A350-1000': 64.75, 'A380-800': 79.75},'length': {'A350-1000': 73.8, 'A380-800': 72.72} })
df_airbus['AAA'] = [2345, 9090]
df_airbus

           range  wingspan  length   AAA
A350-1000  16100     64.75   73.80  2345
A380-800   14800     79.75   72.72  9090

In [38]:
pd.concat((df_airbus, df_boeings))

             range  wingspan  length     AAA     BB6
A350-1000  16100.0     64.75   73.80  2345.0     NaN
A380-800   14800.0     79.75   72.72  9090.0     NaN
B747-8         NaN     68.40   76.30     NaN     NaN
B777-9     13940.0     64.80   76.70     NaN  4550.0
B787-10    11910.0     60.12   68.28     NaN  8866.0

In [39]:
df_airbus['speed'] = [950, 903]
df_airbus

           range  wingspan  length   AAA  speed
A350-1000  16100     64.75   73.80  2345    950
A380-800   14800     79.75   72.72  9090    903

In [56]:
df_aircraft = pd.concat((df_airbus , df_boeings))
df_aircraft

             range  wingspan  length     AAA  speed     BB6
A350-1000  16100.0     64.75   73.80  2345.0  950.0     NaN
A380-800   14800.0     79.75   72.72  9090.0  903.0     NaN
B747-8         NaN     68.40   76.30     NaN    NaN     NaN
B777-9     13940.0     64.80   76.70     NaN    NaN  4550.0
B787-10    11910.0     60.12   68.28     NaN    NaN  8866.0

In [57]:
speeds = df_aircraft['speed']
speeds

A350-1000    950.0
A380-800     903.0
B747-8         NaN
B777-9         NaN
B787-10        NaN
Name: speed, dtype: float64

In [58]:
del df_aircraft['length']
df_aircraft

             range  wingspan     AAA  speed     BB6
A350-1000  16100.0     64.75  2345.0  950.0     NaN
A380-800   14800.0     79.75  9090.0  903.0     NaN
B747-8         NaN     68.40     NaN    NaN     NaN
B777-9     13940.0     64.80     NaN    NaN  4550.0
B787-10    11910.0     60.12     NaN    NaN  8866.0

In [53]:
df_aircraft.drop(['A350-1000'])

            range  wingspan
A380-800  14800.0     79.75
B747-8        NaN     68.40
B777-9    13940.0     64.80
B787-10   11910.0     60.12

In [59]:
df_aircraft.drop(['AAA'], axis='columns', inplace=True)
df_aircraft

             range  wingspan  speed     BB6
A350-1000  16100.0     64.75  950.0     NaN
A380-800   14800.0     79.75  903.0     NaN
B747-8         NaN     68.40    NaN     NaN
B777-9     13940.0     64.80    NaN  4550.0
B787-10    11910.0     60.12    NaN  8866.0